/*     */ package org.apache.lucene.analysis.ru;
/*     */ 
/*     */ public class RussianCharsets
/*     */ {
/*  32 */   public static char[] UnicodeRussian = { 'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я', 'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9' };
/*     */ 
/* 112 */   public static char[] KOI8 = { 'Á', 'Â', '×', 'Ç', 'Ä', 'Å', 'Ö', 'Ú', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï', 'Ð', 'Ò', 'Ó', 'Ô', 'Õ', 'Æ', 'È', 'Ã', 'Þ', 'Û', 'Ý', 'ß', 'Ù', 'Ø', 'Ü', 'À', 'Ñ', 'á', 'â', '÷', 'ç', 'ä', 'å', 'ö', 'ú', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï', 'ð', 'ò', 'ó', 'ô', 'õ', 'æ', 'è', 'ã', 'þ', 'û', 'ý', 'ÿ', 'ù', 'ø', 'ü', 'à', 'ñ', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9' };
/*     */ 
/* 192 */   public static char[] CP1251 = { 'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç', 'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï', 'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷', 'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ', 'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç', 'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï', 'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×', 'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9' };
/*     */ 
/*     */   public static char toLowerCase(char letter, char[] charset)
/*     */   {
/* 273 */     if (charset == UnicodeRussian)
/*     */     {
/* 275 */       if ((letter >= 'а') && (letter <= 'я'))
/*     */       {
/* 277 */         return letter;
/*     */       }
/* 279 */       if ((letter >= 'А') && (letter <= 'Я'))
/*     */       {
/* 281 */         return (char)(letter + ' ');
/*     */       }
/*     */     }
/*     */ 
/* 285 */     if (charset == KOI8)
/*     */     {
/* 287 */       if ((letter >= 'à') && (letter <= 'ÿ'))
/*     */       {
/* 289 */         return (char)(letter - ' ');
/*     */       }
/* 291 */       if ((letter >= 'À') && (letter <= 'ß'))
/*     */       {
/* 293 */         return letter;
/*     */       }
/*     */ 
/*     */     }
/*     */ 
/* 298 */     if (charset == CP1251)
/*     */     {
/* 300 */       if ((letter >= 'À') && (letter <= 'ß'))
/*     */       {
/* 302 */         return (char)(letter + ' ');
/*     */       }
/* 304 */       if ((letter >= 'à') && (letter <= 'ÿ'))
/*     */       {
/* 306 */         return letter;
/*     */       }
/*     */ 
/*     */     }
/*     */ 
/* 311 */     return Character.toLowerCase(letter);
/*     */   }
/*     */ }

/* Location:           /Users/Rashmi/Downloads/set_rp2614/rashmi.jar
 * Qualified Name:     org.apache.lucene.analysis.ru.RussianCharsets
 * JD-Core Version:    0.6.2
 */