/*     */ package org.apache.lucene.analysis.el;
/*     */ 
/*     */ public class GreekCharsets
/*     */ {
/*  30 */   public static char[] UnicodeGreek = { 'ΐ', 'ά', 'έ', 'ή', 'ί', 'ΰ', 'α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'ς', 'σ', 'τ', 'υ', 'φ', 'χ', 'ψ', 'ω', 'ϊ', 'ϋ', 'ό', 'ύ', 'ώ', 'Ά', 'Έ', 'Ή', 'Ί', 'Ό', 'Ύ', 'Ώ', 'Α', 'Β', 'Γ', 'Δ', 'Ε', 'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Ο', 'Π', 'Ρ', 'Σ', 'Τ', 'Υ', 'Φ', 'Χ', 'Ψ', 'Ω', 'Ϊ', 'Ϋ' };
/*     */ 
/* 105 */   public static char[] ISO = { 'À', 'Ü', 'Ý', 'Þ', 'ß', 'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç', 'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï', 'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷', 'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', '¶', '¸', '¹', 'º', '¼', '¾', '¿', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç', 'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï', 'Ð', 'Ñ', 'Ó', 'Ô', 'Õ', 'Ö', '×', 'Ø', 'Ù', 'Ú', 'Û' };
/*     */ 
/* 180 */   public static char[] CP1253 = { 'À', 'Ü', 'Ý', 'Þ', 'ß', 'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç', 'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï', 'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷', 'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', '¢', '¸', '¹', 'º', '¼', '¾', '¿', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç', 'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï', 'Ð', 'Ñ', 'Ó', 'Ô', 'Õ', 'Ö', '×', 'Ø', 'Ù', 'Ú', 'Û' };
/*     */ 
/*     */   public static char toLowerCase(char letter, char[] charset)
/*     */   {
/* 256 */     if (charset == UnicodeGreek)
/*     */     {
/* 258 */       if ((letter >= 'α') && (letter <= 'ω'))
/*     */       {
/* 261 */         if (letter == 'ς') {
/* 262 */           return 'σ';
/*     */         }
/* 264 */         return letter;
/*     */       }
/*     */ 
/* 269 */       if (letter == 'ά') {
/* 270 */         return 'α';
/*     */       }
/*     */ 
/* 273 */       if (letter == 'έ') {
/* 274 */         return 'ε';
/*     */       }
/*     */ 
/* 277 */       if (letter == 'ή') {
/* 278 */         return 'η';
/*     */       }
/*     */ 
/* 281 */       if ((letter == 'ί') || (letter == 'ϊ') || (letter == 'ΐ')) {
/* 282 */         return 'ι';
/*     */       }
/*     */ 
/* 285 */       if ((letter == 'ύ') || (letter == 'ϋ') || (letter == 'ΰ')) {
/* 286 */         return 'υ';
/*     */       }
/*     */ 
/* 289 */       if (letter == 'ό') {
/* 290 */         return 'ο';
/*     */       }
/*     */ 
/* 293 */       if (letter == 'ώ') {
/* 294 */         return 'ω';
/*     */       }
/*     */ 
/* 297 */       if ((letter >= 'Α') && (letter <= 'Ω'))
/*     */       {
/* 299 */         return (char)(letter + ' ');
/*     */       }
/*     */ 
/* 303 */       if (letter == 'Ά') {
/* 304 */         return 'α';
/*     */       }
/*     */ 
/* 307 */       if (letter == 'Έ') {
/* 308 */         return 'ε';
/*     */       }
/*     */ 
/* 311 */       if (letter == 'Ή') {
/* 312 */         return 'η';
/*     */       }
/*     */ 
/* 315 */       if ((letter == 'Ί') || (letter == 'Ϊ')) {
/* 316 */         return 'ι';
/*     */       }
/*     */ 
/* 319 */       if ((letter == 'Ύ') || (letter == 'Ϋ')) {
/* 320 */         return 'υ';
/*     */       }
/*     */ 
/* 323 */       if (letter == 'Ό') {
/* 324 */         return 'ο';
/*     */       }
/*     */ 
/* 327 */       if (letter == 'Ώ')
/* 328 */         return 'ω';
/*     */     }
/* 330 */     else if (charset == ISO)
/*     */     {
/* 332 */       if ((letter >= 'á') && (letter <= 'ù'))
/*     */       {
/* 335 */         if (letter == 'ò') {
/* 336 */           return 'ó';
/*     */         }
/* 338 */         return letter;
/*     */       }
/*     */ 
/* 343 */       if (letter == 'Ü') {
/* 344 */         return 'á';
/*     */       }
/*     */ 
/* 347 */       if (letter == 'Ý') {
/* 348 */         return 'å';
/*     */       }
/*     */ 
/* 351 */       if (letter == 'Þ') {
/* 352 */         return 'ç';
/*     */       }
/*     */ 
/* 355 */       if ((letter == 'ß') || (letter == 'ú') || (letter == 'À')) {
/* 356 */         return 'ι';
/*     */       }
/*     */ 
/* 359 */       if ((letter == 'ý') || (letter == 'û') || (letter == 'à')) {
/* 360 */         return 'õ';
/*     */       }
/*     */ 
/* 363 */       if (letter == 'ü') {
/* 364 */         return 'ï';
/*     */       }
/*     */ 
/* 367 */       if (letter == 'þ') {
/* 368 */         return 'ù';
/*     */       }
/*     */ 
/* 371 */       if ((letter >= 'Á') && (letter <= 'Ù')) {
/* 372 */         return (char)(letter + ' ');
/*     */       }
/*     */ 
/* 376 */       if (letter == '¶') {
/* 377 */         return 'á';
/*     */       }
/*     */ 
/* 380 */       if (letter == '¸') {
/* 381 */         return 'å';
/*     */       }
/*     */ 
/* 384 */       if (letter == '¹') {
/* 385 */         return 'ç';
/*     */       }
/*     */ 
/* 388 */       if ((letter == 'º') || (letter == 'Ú')) {
/* 389 */         return 'é';
/*     */       }
/*     */ 
/* 392 */       if ((letter == '¾') || (letter == 'Û')) {
/* 393 */         return 'õ';
/*     */       }
/*     */ 
/* 396 */       if (letter == '¼') {
/* 397 */         return 'ï';
/*     */       }
/*     */ 
/* 400 */       if (letter == '¿')
/* 401 */         return 'ù';
/*     */     }
/* 403 */     else if (charset == CP1253)
/*     */     {
/* 405 */       if ((letter >= 'á') && (letter <= 'ù'))
/*     */       {
/* 408 */         if (letter == 'ò') {
/* 409 */           return 'ó';
/*     */         }
/* 411 */         return letter;
/*     */       }
/*     */ 
/* 416 */       if (letter == 'Ü') {
/* 417 */         return 'á';
/*     */       }
/*     */ 
/* 420 */       if (letter == 'Ý') {
/* 421 */         return 'å';
/*     */       }
/*     */ 
/* 424 */       if (letter == 'Þ') {
/* 425 */         return 'ç';
/*     */       }
/*     */ 
/* 428 */       if ((letter == 'ß') || (letter == 'ú') || (letter == 'À')) {
/* 429 */         return 'ι';
/*     */       }
/*     */ 
/* 432 */       if ((letter == 'ý') || (letter == 'û') || (letter == 'à')) {
/* 433 */         return 'õ';
/*     */       }
/*     */ 
/* 436 */       if (letter == 'ü') {
/* 437 */         return 'ï';
/*     */       }
/*     */ 
/* 440 */       if (letter == 'þ') {
/* 441 */         return 'ù';
/*     */       }
/*     */ 
/* 444 */       if ((letter >= 'Á') && (letter <= 'Ù')) {
/* 445 */         return (char)(letter + ' ');
/*     */       }
/*     */ 
/* 449 */       if (letter == '¢') {
/* 450 */         return 'á';
/*     */       }
/*     */ 
/* 453 */       if (letter == '¸') {
/* 454 */         return 'å';
/*     */       }
/*     */ 
/* 457 */       if (letter == '¹') {
/* 458 */         return 'ç';
/*     */       }
/*     */ 
/* 461 */       if ((letter == 'º') || (letter == 'Ú')) {
/* 462 */         return 'é';
/*     */       }
/*     */ 
/* 465 */       if ((letter == '¾') || (letter == 'Û')) {
/* 466 */         return 'õ';
/*     */       }
/*     */ 
/* 469 */       if (letter == '¼') {
/* 470 */         return 'ï';
/*     */       }
/*     */ 
/* 473 */       if (letter == '¿') {
/* 474 */         return 'ù';
/*     */       }
/*     */     }
/*     */ 
/* 478 */     return Character.toLowerCase(letter);
/*     */   }
/*     */ }

/* Location:           /Users/Rashmi/Downloads/set_rp2614/rashmi.jar
 * Qualified Name:     org.apache.lucene.analysis.el.GreekCharsets
 * JD-Core Version:    0.6.2
 */